package com.wei.wreader.utils;

/**
 * 常量工具类
 *
 * @author weizhanjie
 */
public class ConstUtil {
    public static final String WREADER_ID = "WReader";
    public static final String WREADER_STATUS_BAR_WIDGET_ID = "wreader.WReaderStatusBarWidget";
    public static final String WREADER_STATUS_BAR_ID = "wreader.WReaderStatusBar";
    /**
     * 配置文件id--设置
     */
    public static final String WREADER_SETTINGS_ID = "wreader.WReaderSetting";
    /**
     * 配置文件id--搜索
     */
    public static final String WREADER_SEARCH_ID = "wreader.SearchBookName";
    /**
     * 配置文件id--目录
     */
    public static final String WREADER_CHAPTER_LIST_ID = "wreader.ChapterListAction";
    /**
     * 配置文件id--上一章
     */
    public static final String WREADER_PREV_CHAPTER_ID = "wreader.PrevChapterAction";
    /**
     * 配置文件id--下一章
     */
    public static final String WREADER_NEXT_CHAPTER_ID = "wreader.NextChapterAction";
    /**
     * 配置文件id--上一行
     */
    public static final String WREADER_PREV_LINE_ID = "wreader.PrevLineAction";
    /**
     * 配置文件id--下一行
     */
    public static final String WREADER_NEXT_LINE_ID = "wreader.NextLineAction";
    /**
     * 配置文件id--字体缩小
     */
    public static final String WREADER_FONT_SIZE_SUB_ID = "wreader.FontSizeSubAction";
    /**
     * 配置文件id--字体放大
     */
    public static final String WREADER_FONT_SIZE_ADD_ID = "wreader.FontSizeAddAction";
    /**
     * 配置文件id--改变字体颜色
     */
    public static final String WREADER_CHANGE_FONT_COLOR_ID = "wreader.ChangeFontColorAction";
    /**
     * 配置文件id--加载本地文件
     */
    public static final String WREADER_LOAD_LOCAL_FILE_ID = "wreader.LoadLocalFileAction";
    /**
     * 工具窗口id
     */
    public static final String WREADER_TOOL_WINDOW_TOOL_BAR_ID = "wreader.toolWindowToolBar";
    /**
     * 工具窗口id
     */
    public static final String WREADER_TOOL_WINDOW_ID = "wreader";
    /**
     * 配置文件id--组--WReader
     */
    public static final String WREADER_GROUP_ID = "wreader.group.WReader";
    /**
     * 配置文件id--组--远程
     */
    public static final String WREADER_GROUP_TOOLMENU_ID = "wreader.group.toolMenu";
    /**
     * 配置文件id--组--工具窗口的工具栏
     */
    public static final String WREADER_GROUP_TOOL_WINDOW_BAR_ID = "wreader.group.toolWindowBar";
    /**
     * 配置文件id--组--状态栏
     */
    public static final String WREADER_GROUP_STATUS_BAR_ID = "wreader.group.statusBar";
    /**
     * 工具窗口标题
     */
    public static final String WREADER_TOOL_WINDOW_TITLE = "WReader";
    /**
     * 工具窗口初始化内容
     */
    public static final String WREADER_TOOL_WINDOW_CONTENT_INIT_TEXT =
            """
                    __      _____    ___    ___    ___    ___    ___  \s
                    \\ \\    / /| _ \\  | __|  /   \\  |   \\  | __|  | _ \\ \s
                     \\ \\/\\/ / |   /  | _|   | - |  | |) | | _|   |   / \s
                      \\_/\\_/  |_|_\\  |___|  |_|_|  |___/  |___|  |_|_\\ \s
                    _|""\"""_|""\"""_|""\"""_|""\"""_|""\"""_|""\"""_|""\"""|\s
                    "`-0-0-"`-0-0-"`-0-0-"`-0-0-"`-0-0-"`-0-0-"`-0-0-'\s
                    """;

    public static final String HTTP_SCHEME = "http://";
    public static final String HTTPS_SCHEME = "https://";
    public static final String HTTP_CONFIG_URL = "url=";
    public static final String WREADER_SEARCH_BOOK_TITLE = "搜索小说";
    public static final String WREADER_SEARCH_BOOK_TIP_TEXT = "请输入书名进行搜索";
    public static final String WREADER_LOAD_SUCCESS = "加载成功";
    public static final String WREADER_SEARCH_EMPTY = "书名不能为空";
    public static final String WREADER_SEARCH_NETWORK_ERROR = "网络请求异常，请重试！";
    public static final String WREADER_SEARCH_BOOK_ERROR = "没有找到相关书籍";
    public static final String WREADER_SEARCH_BOOK_CONTENT_ERROR = "未找到书本内容";
    public static final String WREADER_LOAD_CONTENT_ERROR = "加载内容失败，请重新加载书本！";
    public static final String WREADER_ERROR = "出现异常，请重试！";
    public static final String WREADER_UNSUPPORTED_FILE_TYPE = "不支持此类型的文件！";
    public static final String WREADER_ONLY_SUPPORTED_FILE_TYPE = "只支持%s类型的文件！";
    public static final String WREADER_LOAD_FAIL = "文件加载出现异常，请重试！";
    public static final String WREADER_INIT_ERROR = "W-Reader加载失败！";
    public static final String WREADER_LOADING = "loading...";
    public static final String WREADER_SEARCH_LOADING = "search loading...";
    public static final String WREADER_BOOK = "BOOK";
    public static final String WREADER_DIRECTORY = "directory";
    public static final String WREADER_CONTENT = "content";
    public static final String WREADER_LOAD_LOCAL_TIP = "若目录未加载成功或文字乱码，请尝试修改字符集，然后重新加载文件";
    public static final String WREADER_AUDIO_READING_ERROR = "音频播放异常！";
    public static final String HEADER_USER_AGENT = "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.128 Safari/537.36";
    public static final String STR_ONE = "1";
    public static final String DEFAULT_FONT_FAMILY = "DNMrHsV173Pd4pgy, -apple-system, 'PingFang SC', 'Microsoft YaHei', 'Helvetica Neue', Helvetica, Arial, sans-serif";

    public static final int DEFAULT_FONT_SIZE = 14;
    public static final String DEFAULT_FONT_COLOR_HEX = "#FFFFFF";
    public static final String ELEMENT_CLASS_STR = "class";
    public static final String ELEMENT_ID_STR = "id";
    public static final String NEW_FONT_CLASS_CSS_NAME = ".font-wreader";
    public static final String NEW_FONT_CLASS_NAME = "font-wreader";
    /**
     * 正则表达式--文本文件内容小说目录匹配
     */
    public static final String TEXT_FILE_DIR_REGEX = "(^\\s*第)(.{1,9})[章节卷集部篇回](\\s{1})(.*)($\\s*)";
    /**
     * 正则表达式--匹配HTML标签和空白符
     */
    public static final String HTML_TAG_REGEX = "<[^>]+>|\\s|\\p{Zs}";
    /**
     * 正则表达式--匹配HTML标签
     */
    public static final String HTML_TAG_REGEX_STR = "<[^>]+>";
    /**
     * 文件类型--txt
     */
    public static final String FILE_TYPE_TXT = "txt";
    /**
     * 文件类型--epub
     */
    public static final String FILE_TYPE_EPUB = "epub";
    /**
     * 注释文字颜色
     */
    public static final String LINE_COMMENT_COLOR = "#7A7E85";
    /**
     * 代码配置--开始标签
     */
    public static final String CODE_CONFIG_START_LABEL = "<java>";
    /**
     * 代码配置--结束标签
     */
    public static final String CODE_CONFIG_END_LABEL = "</java>";
    /**
     * 消息提示框宽度
     */
    public static final int HINT_MANAGER_DIALOG_WIDTH = 350;
    /**
     * 消息提示框高度
     */
    public static final int HINT_MANAGER_DIALOG_HEIGHT = 200;
    /**
     * 图片缩略宽度尺寸
     */
    public static final int IMAGE_THUMBNAIL_WIDTH = 150;
    /**
     * 图片预览窗口宽度
     */
    public static final int IMAGE_PREVIEW_WIDTH = 800;
    /**
     * 图片预览窗口高度
     */
    public static final int IMAGE_PREVIEW_HEIGHT = 600;
    /**
     * cssQuery自定义规则标志--@back
     */
    public static final String CSS_QUERY_BACK_FLAG = "@back:";
    /**
     * cssQuery自定义规则标志--@font
     */
    public static final String CSS_QUERY_FONT_FLAG = "@font:";

    public static void main(String[] args) {
        String s = "<p></p>\n" +
                "<p>本文来自 幻梦轻小说</p>\n" +
                "<p>(http://www.huanmengacg.com)</p>\n" +
                "<p></p>\n" +
                "<p>隔天早晨。</p>\n" +
                "<p></p>\n" +
                "<p>饭桌排放着烤鱼和简单、烫青菜和味增汤、酱菜等料理。</p>\n" +
                "<p></p>\n" +
                "<p>“就是这个！这才叫正统的日本式早餐啊！”</p>\n" +
                "<p></p>\n" +
                "<p>恭平说完之后，高兴地疯狂把饭粒往嘴巴里头送。</p>\n" +
                "<p></p>\n" +
                "<p>“早上只吃土司力气根本出不来。”</p>\n" +
                "<p></p>\n" +
                "<p>其他人一边吃饭一边点着头同意。</p>\n" +
                "<p></p>\n" +
                "<p>“食欲整个都恢复了。果然还是须奈子的料理好吃！我们也会帮忙做家事，接下来也要麻烦你了，须奈子。”</p>\n" +
                "<p></p>\n" +
                "<p>这时，须奈子凝视着满面笑容的雪之丞。就在雪之丞看到她的样子后，正觉得有点奇怪时……</p>\n" +
                "<p></p>\n" +
                "<p>“我决定要去研习。”</p>\n" +
                "<p></p>\n" +
                "<p>所有人在听到须奈子这突然的宣言之后都说不出话来。不过话说回来，须奈子本来就常有这种突如其来的行动。</p>\n" +
                "<p></p>\n" +
                "<p>“我说，须奈子……你真的要去吗？”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞言出必行，吃完早饭之后马上就帮忙收拾餐桌。</p>\n" +
                "<p></p>\n" +
                "<p>“反正现在暑假也很空闲，而且我不在的时候，施工人员会身兼厨师煮饭给大家吃。”</p>\n" +
                "<p></p>\n" +
                "<p>“什么——但是我比较喜欢须奈子做的菜啊。每天都吃中华料理也有点……”</p>\n" +
                "<p></p>\n" +
                "<p>“听说厨师也会做和式料理。至于打扫和洗衣服就要拜托你们各自完成了。”</p>\n" +
                "<p></p>\n" +
                "<p>被须奈子低头这么一拜托，雪之丞也不能再多说些什么了。</p>\n" +
                "<p></p>\n" +
                "<p>须奈子要出去研修料理这件事，只有恭平因为以后可以吃到更多种类的料理而高兴不已时而着迷，根本就不听人劝。</p>\n" +
                "<p></p>\n" +
                "<p>（呵呵呵呵。既能够离开闪亮生物，又能学到料理，可以说是一石二鸟。而且那些人都很朴实，一点都不闪亮。）</p>\n" +
                "<p></p>\n" +
                "<p>回到房间的须奈子，一边把行李放进大袋子里，一边对着阿泰他们讲话。</p>\n" +
                "<p></p>\n" +
                "<p>(阿泰、阿晃、约瑟芬。不能跟你们在一起我也很寂寞，但这也是为了渡过酷暑的必要手段。）</p>\n" +
                "<p></p>\n" +
                "<p>须奈子用脸颊磨蹭着一半是脸一半露出整个肌肉的人体模型阿泰，这种模样虽然很恐怖，但她寂寞的感受却是毋庸置疑的。</p>\n" +
                "<p></p>\n" +
                "<p>（研修结束的时候，冰雕的房间不知道完成了没有？）</p>\n" +
                "<p></p>\n" +
                "<p>（啊啊，真是好棒的暑假~）</p>\n" +
                "<p></p>\n" +
                "<p>就这样，须奈子马上就坐上杨派来的黑色轿车，准备朝研修的餐厅出发了。</p>\n" +
                "<p></p>\n" +
                "<p>“那么各位，请千万不要进到我的房间里面去。”</p>\n" +
                "<p></p>\n" +
                "<p>“那么恐怖的房间，就是拜托我我也不想进去。”</p>\n" +
                "<p></p>\n" +
                "<p>“恭平！”</p>\n" +
                "<p></p>\n" +
                "<p>原本专心在看漫画的恭平被半强迫到外面来送行，现在又被武长指责，整个人变得非常不高兴。</p>\n" +
                "<p></p>\n" +
                "<p>但武长早已经习惯该怎么对待恭平，他无视恭平的不高兴再度转向须奈子说道：“对了，须奈子，没跟房东阿姨报告一声真的没关系吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“就是啊。淑女竟然要外宿，房东阿姨一定会很担心的。”</p>\n" +
                "<p></p>\n" +
                "<p>这么符合道德的意见，竟然会从兰丸的嘴里面说出来。</p>\n" +
                "<p></p>\n" +
                "<p>“我才不会外宿呢。”</p>\n" +
                "<p></p>\n" +
                "<p>“是、是这样吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“我才不会跟你一样呢。”</p>\n" +
                "<p></p>\n" +
                "<p>兰丸整个人遭受很大的打击。</p>\n" +
                "<p></p>\n" +
                "<p>“噗哈哈哈哈哈！兰丸，你竟然被中原须奈子吐槽了！”</p>\n" +
                "<p></p>\n" +
                "<p>“吵死了，恭平！”</p>\n" +
                "<p></p>\n" +
                "<p>虽然说是品行端正的兰丸，因为自己经常外宿，所以很可怜地根本没办法回嘴。而且今天虽然是父母亲的命令，但他其实晚上正准备要外宿呢。看来日常的品行真是很重要啊。</p>\n" +
                "<p></p>\n" +
                "<p>“话说回来，你行李还真是一大包耶，不过晚上会回来真是太好了。太晚的话记得打电话回家，我会去接你。”</p>\n" +
                "<p></p>\n" +
                "<p>“谢谢，但他们会开车送我回来，所以没问题的。”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子平常就对素行良好的雪之丞特别温柔。</p>\n" +
                "<p></p>\n" +
                "<p>“那我走了。”</p>\n" +
                "<p></p>\n" +
                "<p>“路上小心啊！”</p>\n" +
                "<p></p>\n" +
                "<p>这时候没有任何人料到，须奈子的研修会给中原宅邸原本和平的生活带来那么大的威胁。</p>\n" +
                "<p></p>\n" +
                "<p>杨经营的餐厅山猫楼，是以广东料理为主的中华料理餐厅。广东料理是以清淡口味来突显食材本身美味的料理居多，并以使用相当丰富的食材而闻名。</p>\n" +
                "<p></p>\n" +
                "<p>这一天，前来研修的须奈子一开始就被带到厨房里面。中华料理最重视的就是火候，而放有许多庞大厨具的宽阔厨房里，吊着许多叉烧和被烤成黄褐色的鸡鸭。</p>\n" +
                "<p></p>\n" +
                "<p>“啊啊，须奈子小姐。欢迎欢迎。”</p>\n" +
                "<p></p>\n" +
                "<p>从大冰箱里拿出蔬菜然后双手抱在手上的周，注意到须奈子之后，对她招了招手。</p>\n" +
                "<p></p>\n" +
                "<p>“你好，请多指教。”</p>\n" +
                "<p></p>\n" +
                "<p>“我们正在准备中午的营业所以有点忙，不嫌弃的话你就先在旁边看吧。下午杨工作结束之后就会过来这边了。”</p>\n" +
                "<p></p>\n" +
                "<p>他一说完便把蔬菜放在调理场，然后对其他厨师发出指示。</p>\n" +
                "<p></p>\n" +
                "<p>“先把这些蔬菜处理一下。”</p>\n" +
                "<p></p>\n" +
                "<p>听到料理长指示的年轻厨师抬起头来，接着注意到站在那里的须奈子。</p>\n" +
                "<p></p>\n" +
                "<p>“呀————”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子为了遮挡日光而把帽子戴得很深，整个人像漂浮一样伫立在那里，看起来根本不想人世间的东西，在看到之后的确会对心脏造成很大的负担。</p>\n" +
                "<p></p>\n" +
                "<p>“师父，这就交给我来吧。”</p>\n" +
                "<p></p>\n" +
                "<p>不理嚇一跳的厨师，须奈子举起手说到。</p>\n" +
                "<p></p>\n" +
                "<p>“嗯——但是用中式菜刀，你可以吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“当然！”</p>\n" +
                "<p></p>\n" +
                "<p>只要是自己有兴趣的事情，须奈子总是像这样奋不顾身。厨房里除了周身之外还有两位厨师，他们也马上恢复过来而开始忙碌了起来。</p>\n" +
                "<p></p>\n" +
                "<p>“那我就不客气了。里面的柜子还有预备的厨师服，请先去把它换上。”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子换上有些大的厨师服后站在堆积如山的蔬菜前面，接着便按照周的指示开始处理起蔬菜来了。</p>\n" +
                "<p></p>\n" +
                "<p>嘶咚咚咚咚咚咚咚咚咚咚</p>\n" +
                "<p></p>\n" +
                "<p>“哦哦哦哦哦哦哦！”</p>\n" +
                "<p></p>\n" +
                "<p>因为太过于快速，拿着菜刀切菜的手几乎可以说是让人看不清楚。周以及其他厨师不由得发出赞叹声。</p>\n" +
                "<p></p>\n" +
                "<p>“好、好快。”</p>\n" +
                "<p></p>\n" +
                "<p>“不只是快而已。你看，白菜也确实把心和叶分开然后切薄，而且厚度还漂亮地分毫不差！”</p>\n" +
                "<p></p>\n" +
                "<p>就在年轻厨师们的赞叹声中，须奈子用非常娴熟的手法不断处理着食材。萝卜皮被切成丁之后整齐地落在盘子上，接着是被切成薄片的洋葱滑过空中。</p>\n" +
                "<p></p>\n" +
                "<p>看到临时学生如此优秀，周那张圆脸上的笑容也就更加夸张了。</p>\n" +
                "<p></p>\n" +
                "<p>“嘿，不要只是感动，你们快点干活。好好学习须奈子小姐那张女性特有的细心啊！”</p>\n" +
                "<p></p>\n" +
                "<p>“知、知道了！”</p>\n" +
                "<p></p>\n" +
                "<p>于是须奈子研习的第一天，便在一开始就速度与力量全开的情况下展开了。</p>\n" +
                "<p></p>\n" +
                "<p>时间过了下午两点。当持续不断的点餐开始减缓速度，得清洗与收拾的盘子比送出去的盘子还要多的时候……</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐，辛苦了。中午营业时间已经结束，可以休息了。”</p>\n" +
                "<p></p>\n" +
                "<p>周两手拿着装有炒饭的盘子走了过来，催促须奈子到二楼去休息。</p>\n" +
                "<p></p>\n" +
                "<p>全部有超过五十个座位的山猫楼，座位几乎全部集中在一楼。二楼只有一个包厢，所以看起来相当宽敞。但午餐时间时若不是爆满的话，是不会使用到这里的。</p>\n" +
                "<p></p>\n" +
                "<p>“中午时段人手特别不足，所以没办法照顾到二楼。”</p>\n" +
                "<p></p>\n" +
                "<p>让须奈子坐在靠窗但不会直接照射到阳光的位置上后，周自己也在她对面坐了下来。</p>\n" +
                "<p></p>\n" +
                "<p>“有须奈子小姐帮忙真是让我们轻松了不少。”</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐？”</p>\n" +
                "<p></p>\n" +
                "<p>叫了好几次须奈子还是没有反应。正当周觉得奇怪，伸出手准备拍一下须奈子的肩膀时。</p>\n" +
                "<p></p>\n" +
                "<p>啪沙————</p>\n" +
                "<p></p>\n" +
                "<p>“哇————”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子的厨师服被像瀑布一样的汗水正濡湿了。在仔细一看，她整个人已经翻白眼了。</p>\n" +
                "<p></p>\n" +
                "<p>“须须须须须奈子小姐。不不不不不要紧吧？”</p>\n" +
                "<p></p>\n" +
                "<p>“……咦？啊，师父。马铃薯的皮已经削好了。”</p>\n" +
                "<p></p>\n" +
                "<p>“谢谢……不对，现在已经是休息时间了。真是可怜，我们让你太劳累了。”</p>\n" +
                "<p></p>\n" +
                "<p>听到师父那担心的声音之后，总算清醒过来的须奈子摇了摇头说：“没有，我很高兴能帮忙。我真的只是不耐热而已。”</p>\n" +
                "<p></p>\n" +
                "<p>就算不耐热好了，流了这么多汗液实在太夸张了，须奈子用周围人交给她的毛巾把汗擦干净。以她的流汗的量来说，只是擦一擦根本没用，应该要换掉整身衣服才行。</p>\n" +
                "<p></p>\n" +
                "<p>“厨房，尤其是做中华料理的厨房，因为火候都开得很大所以非常炎热。须奈子小姐，你这样昏倒的。”</p>\n" +
                "<p></p>\n" +
                "<p>“我不要紧。做事的时候因为专心在料理上面，一点都不觉得热。”</p>\n" +
                "<p></p>\n" +
                "<p>“总之你先多喝点水，然后吃午饭吧。虽然可能没什么食欲。”</p>\n" +
                "<p></p>\n" +
                "<p>周说完之后须奈子边注意到准备要给她吃的炒饭，她把鼻子凑过去闻了一闻。</p>\n" +
                "<p></p>\n" +
                "<p>“师父，好香的味道啊。”</p>\n" +
                "<p></p>\n" +
                "<p>“呼哈哈，那是当然。”</p>\n" +
                "<p></p>\n" +
                "<p>兴致勃勃地用调羹舀起炒饭然后盯着看的须奈子，最后终于受不了香气的诱惑而把它放进嘴里。</p>\n" +
                "<p></p>\n" +
                "<p>吃下去那一瞬间，须奈子周围像是有清爽的凉风吹起，芳香的花朵到处飘散。</p>\n" +
                "<p></p>\n" +
                "<p>“这种香气与清爽的苦味……是柳橙？”</p>\n" +
                "<p></p>\n" +
                "<p>“我用不了橘皮。严格来说品种有点不太一样就是了，在汉方里面叫做陈皮，有促进食欲帮助消化的功能。”</p>\n" +
                "<p></p>\n" +
                "<p>这时候须奈子身体开始想起自己刚才完全没有休息而不断在工作，于是肚子开始饿了起来，接着她的手就再也停不住了，调羹一口接一口把炒饭放进嘴里。</p>\n" +
                "<p></p>\n" +
                "<p>“好吃，太好吃了，榨菜的咸味也恰到好处。我第一次吃到这么好吃的炒饭。”</p>\n" +
                "<p></p>\n" +
                "<p>“我想你身体一定很累了，所以才做了这道炒饭，你能喜欢真是太好了。等一下我再教给你怎么做。”</p>\n" +
                "<p></p>\n" +
                "<p>“好。”</p>\n" +
                "<p></p>\n" +
                "<p>人家说做出来的菜可以透露出厨师的人格，吃过这道炒饭之后，须奈子再度为周那质朴却温柔的心折服。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐真是个奇怪的女孩子，明明都已经这么会做菜，根本不用再学什么东西了。”</p>\n" +
                "<p></p>\n" +
                "<p>“我不太会做中华料理。”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子说到这里，眼神落在快要吃完的炒饭上面。</p>\n" +
                "<p></p>\n" +
                "<p>“而且……”</p>\n" +
                "<p></p>\n" +
                "<p>这是从楼下传来说话的声音，接着可以听到有人开始爬楼梯。</p>\n" +
                "<p></p>\n" +
                "<p>“啊啊，杨回来了。”</p>\n" +
                "<p></p>\n" +
                "<p>身穿黑色西装的杨马上就从二楼入口处露出脸来。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐！欢迎到我们店里来。”</p>\n" +
                "<p></p>\n" +
                "<p>“谢谢。”</p>\n" +
                "<p></p>\n" +
                "<p>杨张开双手表现出盛大欢迎的意思，但须奈子却毫不领情。对须奈子来说，学习周的料理才是她的目的，杨只是个附加品而已。</p>\n" +
                "<p></p>\n" +
                "<p>但他依然是招待自己到这里来的人，所以她还是站起来与杨握手。杨热情地握住须奈子的手后，开始对周围抱怨起来。</p>\n" +
                "<p></p>\n" +
                "<p>“大哥你也真是的。听说你真的让须奈子小姐做事情？让中原小姐的侄女处理蔬菜，这不是太失礼了吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“哎呀，是我不好。”</p>\n" +
                "<p></p>\n" +
                "<p>看到周马上开始道歉，须奈子慌忙说：“是我自己说想帮忙的，我原本就是为了研修才会到这里。”</p>\n" +
                "<p></p>\n" +
                "<p>“是这样吗？那有帮到忙真是太好了。不过等一下要不要一起和个下午茶呢？”</p>\n" +
                "<p></p>\n" +
                "<p>“等一下师父要教我店里面的料理，而且也得做晚上营业前的准备工作。”</p>\n" +
                "<p></p>\n" +
                "<p>“咦？你还想继续做事吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“那是当然。师父他就算在处理蔬菜的时候，动作也是那么确实又仔细，我还有很多事要向他学习呢！”</p>\n" +
                "<p></p>\n" +
                "<p>听到须奈子用充满学习欲望的口气兴奋地说着，杨也不能再多说些什么了。周聪后面追上垂头丧气准备回办公室的杨。</p>\n" +
                "<p></p>\n" +
                "<p>“杨，真是抱歉，我看到须奈子她那么努力。结果就……”</p>\n" +
                "<p></p>\n" +
                "<p>“别放在心上，大哥。”</p>\n" +
                "<p></p>\n" +
                "<p>但杨这时却早已是一副心不在焉的模样。</p>\n" +
                "<p></p>\n" +
                "<p>“杨？”</p>\n" +
                "<p></p>\n" +
                "<p>“没事，虽然很难过不能一起度过午后时光。但须奈子，真的好可爱啊啊啊啊啊啊！”</p>\n" +
                "<p></p>\n" +
                "<p>“？”</p>\n" +
                "<p></p>\n" +
                "<p>“竟然红着脸颊拼命说想要帮忙，跟我周围那些高傲无礼的女孩可以说完全不同！”</p>\n" +
                "<p></p>\n" +
                "<p>被冷淡对待之后，反而更加激起他对须奈子的爱恋。</p>\n" +
                "<p></p>\n" +
                "<p>另一方面，这时候的中原宅邸里。</p>\n" +
                "<p></p>\n" +
                "<p>“肚子好饿——小雪，帮我拿洋芋片——”</p>\n" +
                "<p></p>\n" +
                "<p>就算只是待在客厅里面看漫画闲晃，恭平还是忍不住想吃东西，可见他的食欲已经完全恢复了。</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞拿着洋芋片的袋子把它交给恭平，接着洋芋片的碎片便开始散落到地面，中午吃完的饭团与三明治包装纸片也乱丢在桌子上。只要须奈子不在，中原宅邸就乱得跟猪窝一样。</p>\n" +
                "<p></p>\n" +
                "<p>“晚上会有职业厨师来帮我们做菜吧？不知道会是什么菜色……”</p>\n" +
                "<p></p>\n" +
                "<p>虽然大家很喜欢须奈子平时做的料理，但现在家里也只剩下三个人而已。</p>\n" +
                "<p></p>\n" +
                "<p>他们就在这种散漫的状态下慵懒地待在家里。这时候，忽然回来的房东阿姨可说是吓破胆了他们的胆……</p>\n" +
                "<p></p>\n" +
                "<p>磅————————！</p>\n" +
                "<p></p>\n" +
                "<p>“房房房房东阿姨！？”</p>\n" +
                "<p></p>\n" +
                "<p>不过话说回来，房东阿姨总是突然就跑回家来，所以他们很快便恢复正常了。武先是畏畏缩缩地问：“怎么忽然回来了？”</p>\n" +
                "<p></p>\n" +
                "<p>房东阿姨被这么一问，整个人表现出焦躁与气愤的模样。</p>\n" +
                "<p></p>\n" +
                "<p>“真是——你们听听看！那家业者，一开始竟然是以这栋房子为目的才会接近我的！”</p>\n" +
                "<p></p>\n" +
                "<p>“以这栋房子为目的，难道是想买下来？”</p>\n" +
                "<p></p>\n" +
                "<p>“只是想买下来的话那还算是好的了呢。我调查了一下提出收购的那家公司，发现他们是和黑道有关联的恶劣不动产公司！”</p>\n" +
                "<p></p>\n" +
                "<p>开始有不祥预感的三个人，由不得望向彼此的脸。然后武长再度畏缩地问：“房东阿姨，你说的那家业者难道就是……”</p>\n" +
                "<p></p>\n" +
                "<p>“就是预定帮我们做冰雕屋的业者啊！虽然与不动产公司名称不同，但调查一下马上就知道他们暗地里有关系了。”</p>\n" +
                "<p></p>\n" +
                "<p>而须奈子现在一个人，跑到那家与有黑道背景的恶劣不动产公司扯上关系的业者那里研习中……</p>\n" +
                "<p></p>\n" +
                "<p>“他们好像连我们的内部装潢都知道，我觉得奇怪于是调查了一下……结果他们一开始就是想要勘查房子的内部，才会提出什么冰雕的企案来。”</p>\n" +
                "<p></p>\n" +
                "<p>“那、那房东阿姨，现在该怎么办？”</p>\n" +
                "<p></p>\n" +
                "<p>武长开始有点慌了。</p>\n" +
                "<p></p>\n" +
                "<p>“什么怎么办，就是他们威胁我，我也不打算把这里卖掉。当然是工程中止，就这样简单。”</p>\n" +
                "<p></p>\n" +
                "<p>房东阿姨虽然平淡地说着，但这个人的确不可能屈服在威胁之下。因为她跟警政署长也是很好的朋友。</p>\n" +
                "<p></p>\n" +
                "<p>不过如果须奈子被对方当成人质的话呢？三人的脑海里同时出现了抢在武装直升机编队前的房东阿姨，那种宛如恶鬼般的形象。</p>\n" +
                "<p></p>\n" +
                "<p>光是想象出现这种情况时会有多大的损害，三个人就一阵发冷，虽说那也是恶劣业者自作自受，没人救得了他们，但问题是，他们并不知道业者的真正身份就让须奈子跑到那里去研习了。</p>\n" +
                "<p></p>\n" +
                "<p>他们三个人告诉房东阿姨须奈子只是去买东西，好让她早点离开之后，随即用音速交互看着对方的脸孔。</p>\n" +
                "<p></p>\n" +
                "<p>“怎么办，怎么办啦！让房东阿姨发现的话，可不是缴交全额房租就能了事的！”</p>\n" +
                "<p></p>\n" +
                "<p>“就是啊……房东阿姨视须奈子为自己的心头肉。要是让她发现我们让须奈子自己一个人到那么危险的地方去……”</p>\n" +
                "<p></p>\n" +
                "<p>快要哭出来的雪之丞接下去说道“除了要我们付出到目前为止的全额房租之物，还会把我们五花大绑，绑起来鞭打，然后不准吃东西……”</p>\n" +
                "<p></p>\n" +
                "<p>“不要啊————！！！”</p>\n" +
                "<p></p>\n" +
                "<p>三名美少年因为房东阿姨这个活生生的恐怖存在而缩在一起发抖。</p>\n" +
                "<p></p>\n" +
                "<p>这时的须奈子完全不知道发生在他们身上的事，一个人在可疑组织里面和满是汉字的菜单搏斗着。</p>\n" +
                "<p></p>\n" +
                "<p>“你看，就像这个样子，料理名称大多是由食材与调理方法组合而成的。”</p>\n" +
                "<p></p>\n" +
                "<p>“原来如此。这个‘炸’是？”</p>\n" +
                "<p></p>\n" +
                "<p>“这个字念做‘ㄓㄚ’。就是把食材放进热油里面。你就是想成食材放进热油里面，会发出‘喳’的声音就很容易记住了。”</p>\n" +
                "<p></p>\n" +
                "<p>“我知道了。”</p>\n" +
                "<p></p>\n" +
                "<p>周并不主动教导须奈子，而是以回答她问题的形式进行授课。面对不熟悉的调味料与素材，须奈子不断提出问题，时间一下子便过去了。</p>\n" +
                "<p></p>\n" +
                "<p>当周说着该是回去厨房的时候而来到走廊时，杨刚好也从办公室里面走出来，准备喘口气。</p>\n" +
                "<p></p>\n" +
                "<p>“啊啊，须奈子小姐，辛苦你了。”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子虽然对着这么说的杨轻轻点了下头，但杨的脸看起来才真的让人想对他说这句话。</p>\n" +
                "<p></p>\n" +
                "<p>“发生什么事了吗？杨。”</p>\n" +
                "<p></p>\n" +
                "<p>“沒有，我不要紧。对了，须奈子小姐，你的房间和家具是什么样的感觉？”</p>\n" +
                "<p></p>\n" +
                "<p>“家具和房子好像都是整个从英国搬过来的样子……”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子的房间里面放着一张四柱床，豪华程度可以说跟公主的房间相比也毫不逊色。只不过里面还放有许多骸骨、人体模型和观赏DVD用的大型电视机。</p>\n" +
                "<p></p>\n" +
                "<p>“正如我所想的一样。那本来就是一栋豪宅，所以方那些豪华家具一点也不显得突兀。”</p>\n" +
                "<p></p>\n" +
                "<p>“杨？”</p>\n" +
                "<p></p>\n" +
                "<p>“没有啦，你记得吗？我们到中原小姐家去探勘场地的时候，须奈子不是跟一个少年吵架，结果还对他飞踢过去吗？”</p>\n" +
                "<p></p>\n" +
                "<p>看到阿泰被拿来当成盾牌之后，须奈子整个人很火大，正巧在杨他们面前使出了飞踢。</p>\n" +
                "<p></p>\n" +
                "<p>“那时候的画面一直深印在我脑海里，简直就像好莱坞电影的一个场景一样。”</p>\n" +
                "<p></p>\n" +
                "<p>“喝……”</p>\n" +
                "<p></p>\n" +
                "<p>“没错……就是这样，咦？咦？”</p>\n" +
                "<p></p>\n" +
                "<p>“喝！哈！”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子在走廊上朝着四面八方伸出拳头，而杨完全不知道究竟发生了什么事。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐，在那边。在楼梯那边。”</p>\n" +
                "<p></p>\n" +
                "<p>“咦？大哥，什么东西在那边？”</p>\n" +
                "<p></p>\n" +
                "<p>“有一只大苍蝇飞进来了。啊啊，须奈子小姐，太危险了。”</p>\n" +
                "<p></p>\n" +
                "<p>一看之下原来须奈子飞到楼中楼的楼梯扶手上准备抓住苍蝇。木制的扶手虽然有点宽度，但另一边就是一楼入口处的地板了。</p>\n" +
                "<p></p>\n" +
                "<p>“喝！！”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子转过身来之后，从扶手上轻轻往走廊这边跳了下来。她的动作就跟忍者一样轻盈，楼中楼上的灯光从后面照了过来，让须奈子的长发整个闪闪发亮。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐，你没事就好。请不要做那么危险的事。”</p>\n" +
                "<p></p>\n" +
                "<p>周虽然松了一口气，但杨整个人像连呼吸都停住似的僵在当场。</p>\n" +
                "<p></p>\n" +
                "<p>“太美了……即使场地在山猫楼，只要须奈子一动就像是电影里的场景一样吗……”</p>\n" +
                "<p></p>\n" +
                "<p>周和须奈子都沒有听见杨那像在呓语般的声音，但杨马上就从做梦一样表情当中恢复过来，接着转向须奈子。他的声音明显已经相当冷静下来了。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐，我刚才与中原小姐通过电话，她说如果你晚上也要工作，回家就太晚了。干脆就在这里住下来会比较好。”</p>\n" +
                "<p></p>\n" +
                "<p>“姑姑她这么说？”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子虽然一脸不可思议的表情，但马上就摇了摇头说：</p>\n" +
                "<p></p>\n" +
                "<p>“没关系，只要开车送我回去，马上就到了。”</p>\n" +
                "<p></p>\n" +
                "<p>但杨却堆满笑容继续说道：</p>\n" +
                "<p></p>\n" +
                "<p>“不，我已经对中原小姐说在旁边的别馆准备号你的房间了，请她不用担心，就请你给我个面子吧。”</p>\n" +
                "<p></p>\n" +
                "<p>原本在一旁静静听着的周，发现此时杨努力说服须奈子的脸，与表示须奈子专心与料理真是太可爱了的表情一模一样。于是周也帮忙劝须奈子说：</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐。既然你姑姑也赞成了，那你就住下来吧。住下来的话，明天早上我可以教你做港式早餐。”</p>\n" +
                "<p></p>\n" +
                "<p>经周这么一说，须奈子也就没有坚决拒绝的理由了。杨应该有派人帮忙到家里做饭才对，况且现在又是暑假，稍微不做一点家事应该也沒关系，何况闪亮的生物们也说要帮忙了。</p>\n" +
                "<p></p>\n" +
                "<p>杨目前已经逐渐把兴趣由中原宅邸转到须奈子身上。何况得到须奈子的话，也就等于有了得到中原宅邸的契机。</p>\n" +
                "<p></p>\n" +
                "<p>杨一直希望把电影里的坏人世界在现实中实现，而中原宅邸正是最适合的舞台。山猫楼的规模实在太小了，就算家具再怎么研究，所能传造出来的效果还是有限。</p>\n" +
                "<p></p>\n" +
                "<p>但是在看过须奈子刚才的动作之后，杨的想法有了大大地转变。</p>\n" +
                "<p></p>\n" +
                "<p>这样也不错啊！山猫楼只要有须奈子在就很不错。</p>\n" +
                "<p></p>\n" +
                "<p>杨带着满脸笑意回到办公室之后，听到刚才那番话的西装男把疑问说了出来：</p>\n" +
                "<p></p>\n" +
                "<p>“杨先生，跟中原寡妇的交涉不是已经决裂了吗？你什么时候跟她谈到那女孩的事情？”</p>\n" +
                "<p></p>\n" +
                "<p>“嗯——？我没跟她谈啊。中原小姐果然如传闻中一样不是容易对付的角色。”</p>\n" +
                "<p></p>\n" +
                "<p>由于负责交涉的不动产公司完全弹不出结果，于是杨便亲自出马打了通电话给须奈子的姑姑。但是对方早已经知道杨的来历，根本没办法谈到购买房子的事。须奈子的姑姑除了没把杨当一回事之外，甚至反而威胁说“再罗嗦的话，明天早上警察就会到你们店里去搜查”，然后就把电话挂了。</p>\n" +
                "<p></p>\n" +
                "<p>说起来，货真价实的黑道只到杨的父亲那一带而已，杨本身就不是在刀光剑影的世界中讨生活的人；须奈子的姑姑则是丈夫死后，便独自一人在连黑道都会变脸的国际商业战场里开拓疆土。所以她在电话里面透露出那种咄咄逼人的魄力，让杨也不由得发起抖来。</p>\n" +
                "<p></p>\n" +
                "<p>“啊——原来如此。那是准备把女孩拿来当人质，逼对方放弃那栋房子吗？”</p>\n" +
                "<p></p>\n" +
                "<p>对基本上还是老板当成黑道首领的黑西装男来说，这种流程是再自然不过了。</p>\n" +
                "<p></p>\n" +
                "<p>“那一套已经不符合潮流了，或许我真的太小看那个寡妇，但我也还没有放弃。现在我有比那栋房子还想要的东西了。”</p>\n" +
                "<p></p>\n" +
                "<p>“比房子还想要？”</p>\n" +
                "<p></p>\n" +
                "<p>“就是可爱的须奈子。总觉得只要有须奈子，就能够一次获得全部我想要的东西。”</p>\n" +
                "<p></p>\n" +
                "<p>到现在仍然没办法了解须奈子魅力的黑西装男，开始觉得没办法理解老大的野心究竟是在什么地方了。</p>\n" +
                "<p></p>\n" +
                "<p>当最后还是决定住下来的须奈子被带到别馆的房间里时，武长和雪之丞正抬头看着山猫楼这栋炼瓦色的建筑。</p>\n" +
                "<p></p>\n" +
                "<p>之后他们三个人商量了一下，决定在须奈子出门研修这件事还没被房东阿姨发现之前就把她给带回来。</p>\n" +
                "<p></p>\n" +
                "<p>恭平用想知道漫画后续发展这种烂理由坚决要在家里留守，武长和雪之丞只好丢下他不管，自行来到了山猫楼。现在雪之丞鼓起了勇气把门推开。</p>\n" +
                "<p></p>\n" +
                "<p>“真是抱歉，还让你们亲自跑了一趟……”</p>\n" +
                "<p></p>\n" +
                "<p>被招待在二楼办公室里面喝茶的武长和雪之丞不由得面面相觑。</p>\n" +
                "<p></p>\n" +
                "<p>他们到访时，须奈子刚好不在，按照眼前这个黑西装男的说法，她为了买晚餐时要穿的衣服和杨一起出去逛街了。</p>\n" +
                "<p></p>\n" +
                "<p>“我现在就去准备一些点心，你们在这里稍微休息一下吧。”</p>\n" +
                "<p></p>\n" +
                "<p>“啊，不用费心了。既然须奈子不在，我们也马上要回去了。”</p>\n" +
                "<p></p>\n" +
                "<p>武长如此回应之后，黑西装男毫不在意地敬了一个礼后就离开了房间。确认对方已经离开后，雪之丞小声问道：</p>\n" +
                "<p></p>\n" +
                "<p>“你不觉得很奇怪吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“的确很奇怪。”</p>\n" +
                "<p></p>\n" +
                "<p>“就是啊，须奈子绝对不可能主动说要去买衣服才对。”</p>\n" +
                "<p></p>\n" +
                "<p>更不可能的是，对方竟然说杨与须奈子两个人已经情投意合了。所谓的情投意合也就是恋爱关系，对非常了解须奈子的武长与雪之丞来说，这就像恭平和须奈子两个人到游乐场里面约会一样不可能发生。</p>\n" +
                "<p></p>\n" +
                "<p>如果须奈子身为女性的自觉那么容易便觉醒的话，那他们也不会这么累了。</p>\n" +
                "<p></p>\n" +
                "<p>这时候，黑西装男在楼下对着手机发牢骚说：</p>\n" +
                "<p></p>\n" +
                "<p>“摆脱一下啦，杨老大。对方很明显怀疑我们的说法。我看说你和那女孩已经坠入爱河实在太令人难以相信了。”</p>\n" +
                "<p></p>\n" +
                "<p>暂时把介绍房间的工作交给周之后，杨来到离须奈子有点距离的地方。他用不让须奈子他们听到的声音说道：</p>\n" +
                "<p></p>\n" +
                "<p>“无论如何，只要撑过今晚就生米煮成熟饭了，随便找个理由把他们赶走就行了。”</p>\n" +
                "<p></p>\n" +
                "<p>“唉～”</p>\n" +
                "<p></p>\n" +
                "<p>真的是这样吗？黑西装男绞尽脑汁也得不到答案。</p>\n" +
                "<p></p>\n" +
                "<p>另一方面，被留在房间里的武长和雪之丞，虽然感到怀疑也没有别的办法。</p>\n" +
                "<p></p>\n" +
                "<p>“怎么办？武长。”</p>\n" +
                "<p></p>\n" +
                "<p>“餐厅表面上没有什么可疑的地方，我们也不能在这里引起骚动。我看也只有让他们请须奈子跟我们连络，然后今天先回去吧。”</p>\n" +
                "<p></p>\n" +
                "<p>“嗯。”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞闷闷不乐，不禁畏畏缩缩地把刚才就一直在脑海里的问题提了出来。</p>\n" +
                "<p></p>\n" +
                "<p>“那个，难道说……他们应该不会真的打算把须奈子当成人质吧？”</p>\n" +
                "<p></p>\n" +
                "<p>这时候，旁边的房间传来了奇怪的声音……</p>\n" +
                "<p></p>\n" +
                "<p>“怎、怎么回事？”</p>\n" +
                "<p></p>\n" +
                "<p>胆子特别小的雪之丞马上从沙发上跳了起来。</p>\n" +
                "<p></p>\n" +
                "<p>“冷静一点，小雪。”</p>\n" +
                "<p></p>\n" +
                "<p>“难道是须奈子！？”</p>\n" +
                "<p></p>\n" +
                "<p>武长悄悄走过去后，把耳朵贴在刻有装饰的木门上听着。</p>\n" +
                "<p></p>\n" +
                "<p>“好像有人在里面……”</p>\n" +
                "<p></p>\n" +
                "<p>这次他小心翼翼地轻轻敲了一下门，没想到从旁边房间传出来的摩擦声变得更大声了。</p>\n" +
                "<p></p>\n" +
                "<p>武长慢慢转了一下门把，却发出“咔嚓”这种上了锁的声音。</p>\n" +
                "<p></p>\n" +
                "<p>“武长，用这个。”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞马上从旁边的书架上拿了把小钥匙交给武长。</p>\n" +
                "<p></p>\n" +
                "<p>他们打开的房间原本应该是寝室。空间虽然不算大，但是放着一张双人床，还有一套笑桌椅立于窗边。</p>\n" +
                "<p></p>\n" +
                "<p>之所以知道现在没人使用这个房间，是因为不论床上或是桌子上，都堆满了书本、资料、衣服等物品。</p>\n" +
                "<p></p>\n" +
                "<p>在床前，从窗户透进来的亮光与阴影交界处，有一个穿着灰色工作服的男性手脚被帮着躺在地面上。</p>\n" +
                "<p></p>\n" +
                "<p>“武长！”</p>\n" +
                "<p></p>\n" +
                "<p>“嘘……”</p>\n" +
                "<p></p>\n" +
                "<p>制止跟在后面准备冲进房间来的雪之丞后，武长走进那个男人，蹲下来仔细看着他的脸。虽然对方眼睛被遮住，嘴巴也被用胶带贴上，所以没办法看清楚整个人的脸，但可以知道是个脸颊骨突出的瘦削男性。年纪应该是三十来岁左右吧。</p>\n" +
                "<p></p>\n" +
                "<p>“啊啊，不行，不行啊！请离开那个房间。”</p>\n" +
                "<p></p>\n" +
                "<p>背後突然有声音响起，武长整个人几乎快向前倒过去，雪之丞则急忙把钥匙放回原来的地方，然后像要用背部挡住钥匙般转过身去。</p>\n" +
                "<p></p>\n" +
                "<p>一看之下，他们发现黑西装男苦着一张脸从办公室外面走进来。</p>\n" +
                "<p></p>\n" +
                "<p>“那家伙是刚才抓到的小偷，我们已经报案请警察来把他带走了。这附近最近也不怎么安宁。”</p>\n" +
                "<p></p>\n" +
                "<p>“对不起，我们随便就跑进来。”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞老实向对方道歉。武长在瞥了一下地上的男人之后也站起身来，轻轻对黑西装男低了一下头。</p>\n" +
                "<p></p>\n" +
                "<p>“真是抱歉，我们因为听到有声音所以才跑进去。遭小偷之后，店里一定一团乱吧！”</p>\n" +
                "<p></p>\n" +
                "<p>黑色西装男看着两人的样子虽然沒有特别凶恶，反而更透露出一种令人怀念的感觉。</p>\n" +
                "<p></p>\n" +
                "<p>“就是啊。刚刚警察打电话来，说现在就要把他带走。很抱歉，今天就请你们先回去吧。”</p>\n" +
                "<p></p>\n" +
                "<p>对方原本说要去准备茶点，现在却下起逐客令……但即使如此，武长他们也没办法说些什么。他们两人对望了一下之后，马上对黑西装男子行了个礼，接着说：</p>\n" +
                "<p></p>\n" +
                "<p>“好吧。很抱歉在这么忙碌的时候来打扰你们。麻烦请你转达须奈子，请她记得跟我们连络。”</p>\n" +
                "<p></p>\n" +
                "<p>他们就像被黑西装男用眼神赶出去般，迅速离开了山猫楼</p>\n" +
                "<p></p>\n" +
                "<p>走到大马路附近之后，武长拿出了手机。</p>\n" +
                "<p></p>\n" +
                "<p>“喂喂。啊啊，恭平？我有事要你帮忙查一下。我请你吃可乐饼，等一下到外面来跟我们会合。”</p>\n" +
                "<p></p>\n" +
                "<p>决定号跟恭平会合的地点之后武长便把手机挂断，举起手来召了一辆计程车。</p>\n" +
                "<p></p>\n" +
                "<p>“武长，我们要去哪里？”</p>\n" +
                "<p></p>\n" +
                "<p>完全不知道武长在想什么的雪之丞，慌忙跟在武长后面坐上了计程车。</p>\n" +
                "<p></p>\n" +
                "<p>“那个被绑起来的男人，工作服上写着‘山中精肉店’。我让恭平查了一下这附近是不是有这个店名的肉店……”</p>\n" +
                "<p></p>\n" +
                "<p>“你是要去确定刚才那个人讲的话是不是真的吧？”</p>\n" +
                "<p></p>\n" +
                "<p>“嗯。”</p>\n" +
                "<p></p>\n" +
                "<p>面对这突如其来的发展，两个人脸上的表情自然变得相当僵硬。希望在没出什么篓子之前，须奈子能够平安回来就好了。</p>\n" +
                "<p></p>\n" +
                "<p>抬头往花岗石打造的闪亮入口上方看去，可以看见上面刻有大大的“山中”金色字样。这附近的大楼里混杂有不少历史悠久的料亭与时髦酒吧，而这家肉店便是开在这种地段的一角。实际上，山中精肉店并不是武长他们想象中那种商店街里的一般肉店。</p>\n" +
                "<p></p>\n" +
                "<p>排有肉块的展示柜显示出这里的确是肉店，但光是柜子放在同样磨得十分闪亮的花岗石地板上这点，就让人感觉这些肉块像是宝石或是名牌包包一样了。</p>\n" +
                "<p></p>\n" +
                "<p>那些肉就像美术品一样被妥善地排在一起，前面的牌子上面都用笔写着知名的品牌名称，但没有明确标示出价格。</p>\n" +
                "<p></p>\n" +
                "<p>三个人先是在入口的地方犹豫着要不要进去，接着又在看板下面小声交谈着。</p>\n" +
                "<p></p>\n" +
                "<p>“真的只有这里而已吗？恭平。”</p>\n" +
                "<p></p>\n" +
                "<p>“什么嘛，我可是仔细查过啰。这区里面只有这家‘山中精肉店’。”</p>\n" +
                "<p></p>\n" +
                "<p>“看来也不一定是这附近的肉店。”</p>\n" +
                "<p></p>\n" +
                "<p>“比起那个，像这种高贵的店里面应该沒有卖可乐饼吧？”</p>\n" +
                "<p></p>\n" +
                "<p>武长仰望头上的看板，然后又瞄了一下展示柜对面的店员。店员身穿白色T恤和黑色围裙这种样式简单的制服，跟被绑起来的男人身上穿的工作服完全不同。就像雪之丞所说的，可能真的不是附近的商店也说不定。</p>\n" +
                "<p></p>\n" +
                "<p>“搞什么……我可是满怀期待可以迟到刚炸好的可乐饼……”</p>\n" +
                "<p></p>\n" +
                "<p>“嘘……”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞打断恭平的话。从入口旁边的小路上，有一名穿着工作服、手里拿着小包包的男性走了出来。看样子可能是要去便利商店吧。</p>\n" +
                "<p></p>\n" +
                "<p>当男性转过大马路转角时，一直看着他背影的武长张开口说道：</p>\n" +
                "<p></p>\n" +
                "<p>“我想应该是一样的工作服吧。”</p>\n" +
                "<p></p>\n" +
                "<p>……那是一样的淡灰色工作服，上面绣有“山中精肉店”字样。</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞凝神往店里展示柜后面看去。那里面应该有作业场，而在山猫楼见到的那个男人一定就在里面工作。</p>\n" +
                "<p></p>\n" +
                "<p>“怎么办，要不要直接问问看？”</p>\n" +
                "<p></p>\n" +
                "<p>“问说你们公司的工作人员是不是有人当小偷？这不太好吧……”</p>\n" +
                "<p></p>\n" +
                "<p>武长和雪之丞绞尽脑汁想着该怎么询问比较恰当。为了可乐饼而在电话簿上查到这家店然后过来集合的恭平，似乎对这种没卖一般平民食物的店非常不满，整个人变得很有攻击性。</p>\n" +
                "<p></p>\n" +
                "<p>“去问个清楚不就得了。”</p>\n" +
                "<p></p>\n" +
                "<p>他说完之后便大喇喇走进店里。</p>\n" +
                "<p></p>\n" +
                "<p>从结帐柜台走出一名身穿黑色衣服，看起来像是经理的男性。他对着恭平说了声“欢迎光临。”</p>\n" +
                "<p></p>\n" +
                "<p>“喂，你们有卖可乐饼吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“什么？”</p>\n" +
                "<p></p>\n" +
                "<p>经理原本就是一幅要把这穷酸小伙子给赶出去的模样，但一看见恭平的美貌之后，整个人呆呆地张大了嘴巴。</p>\n" +
                "<p></p>\n" +
                "<p>“抱、抱歉。我们沒有店头贩卖。”</p>\n" +
                "<p></p>\n" +
                "<p>“那那些不是要卖的吗？”</p>\n" +
                "<p></p>\n" +
                "<p>恭平用手大概比了一下那些肉块。</p>\n" +
                "<p></p>\n" +
                "<p>“当然这些肉都有在贩卖，但不是在上面的餐厅里直接品尝该种肉品的料理，就是以预购的形式来购买。放在这里的只是参考商品而已。”</p>\n" +
                "<p></p>\n" +
                "<p>“这样啊……”</p>\n" +
                "<p></p>\n" +
                "<p>“倒、倒是你啊……又没有兴趣在我们店里工作。不是站在这边，而是在上面的会员制餐厅里，那边都是有钱的客人，又有保障时薪喔。”</p>\n" +
                "<p></p>\n" +
                "<p>身材并不高大，有着瘦削、苍白的脸孔，下巴还留着胡须的经理谄媚地抬头看着恭平，嘴角始终带着微笑。</p>\n" +
                "<p></p>\n" +
                "<p>“刚刚有看见穿着工作服的家伙走出去，不会到时候叫我到那边去做事吧。”</p>\n" +
                "<p></p>\n" +
                "<p>“啊哈哈哈。不不不，像你这样难得的人才怎么可能叫你到后面做事呢？虽然我们最近后场的确人手不足……”</p>\n" +
                "<p></p>\n" +
                "<p>看见恭平似乎有点兴趣之后，经理的态度也变得更加亲切。</p>\n" +
                "<p></p>\n" +
                "<p>“不会是因为雇佣条件太差才辞职的吧？”</p>\n" +
                "<p></p>\n" +
                "<p>“怎么可能。那男的虽然是外国人，但我们对他很好啊。但他竟然暗中偷了一大批松阪牛肉，然后就不见了。”</p>\n" +
                "<p></p>\n" +
                "<p>武长和雪之丞原本在外面紧张地看着恭平的行动，发现恭平和经理聊了起来之后也跟着进到店里面来。</p>\n" +
                "<p></p>\n" +
                "<p>“那不就是……”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞差点就讲出不就是在山猫楼被抓走的男人吗，但最后关头急忙闭上了自己的嘴巴。</p>\n" +
                "<p></p>\n" +
                "<p>“现在想起来，那家伙有过好几次可疑的行为了。真是的，临时到哪里區雇人呢？”</p>\n" +
                "<p></p>\n" +
                "<p>经理说完之后又注意到武长和雪之丞两个人，只见他眼睛发光赶紧试着邀他们到店里工作，但武长却慎重地拒绝了他的邀请。</p>\n" +
                "<p></p>\n" +
                "<p>“恭平你也真是的，钥匙走了他事情就难以收拾了。”</p>\n" +
                "<p></p>\n" +
                "<p>“因为那家伙真的很烦嘛。”</p>\n" +
                "<p></p>\n" +
                "<p>回家的路上，被武长指责的恭平撅起嘴巴如此回答道。</p>\n" +
                "<p></p>\n" +
                "<p>当恭平因为经理死缠着他们不放而忍耐不住想出手揍他时，武长和雪之丞两个人好不容易才将恭平拖了出来。</p>\n" +
                "<p></p>\n" +
                "<p>“真的刚好在那边当小偷结果被抓到了吗……”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞嚅嗫道。</p>\n" +
                "<p></p>\n" +
                "<p>“就算两家店很近好了，在肉店里偷东西的家伙又被人关在餐厅的办公室里面，你们不觉得太不自然了吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“别馆这件事了。我们只要让中原须奈子赶快回来，就不会被房东阿姨发现了不是吗？”</p>\n" +
                "<p></p>\n" +
                "<p>相对于陷入长考的武长，恭平还是一样我行我素。</p>\n" +
                "<p></p>\n" +
                "<p>“是这样没错，但小雪担心的事或许会变成真的也不一定啊。”</p>\n" +
                "<p></p>\n" +
                "<p>“你说我担心的事，难道是指须奈子被当成人质！？”</p>\n" +
                "<p></p>\n" +
                "<p>依照武长的想法，合理的解释应该是对方在偷了肉店的高级食材之后违法卖给了餐厅。然后那个男人是因为不知道为什么跟山猫楼的人翻脸了才会被抓起来。</p>\n" +
                "<p></p>\n" +
                "<p>为了威胁绝对不可能卖掉宅邸的房东阿姨，杨或许会拿须奈子来当人质也说不定。武长衙门也很明显看出那群人非常可疑，须奈子愈来愈有可能真的遭遇到危机了。</p>\n" +
                "<p></p>\n" +
                "<p>“哇哈哈哈！你说当人质呀！”</p>\n" +
                "<p></p>\n" +
                "<p>“恭平！”</p>\n" +
                "<p></p>\n" +
                "<p>“你不用担心那个家伙啦。”</p>\n" +
                "<p></p>\n" +
                "<p>面对依然乐观的恭平，武长不禁用严厉的口气说：</p>\n" +
                "<p></p>\n" +
                "<p>“恭平，你知道为什么原本就很会做菜的须奈子，这次还要特别跑去学做料理吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“只是因为那个家伙本来就很喜欢吧。”</p>\n" +
                "<p></p>\n" +
                "<p>恭平虽然冷淡地回答，但雪之丞似乎想起什么似的说了声“对了”。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子一定是为了要做中华料理给我们吃才会跑去研习的。因为我们那时候一直喊着干烧虾仁很好吃什么的。”</p>\n" +
                "<p></p>\n" +
                "<p>“如果须奈子已经被抓起来了怎么办？”</p>\n" +
                "<p></p>\n" +
                "<p>看到雪之丞这么担心，恭平的表情也稍微认真了一点点。</p>\n" +
                "<p></p>\n" +
                "<p>“如果真是这样，房东阿姨绝对不会饶了他们。话说回来，那家伙哪会怪怪让人抓住呢？要担心的话，倒不如担心那些坏人反而会被她摆平了呢。”</p>\n" +
                "<p></p>\n" +
                "<p>说再多话也沒用，现在也只有等待须奈子主动跟他们连络，不然就是等犯人打电话来威胁他们了。</p>\n" +
                "<p></p>\n" +
                "<p>三个人来到山中精肉店时，曾看见一个从店旁边小路里出来的男人。那个男人假装离开现场之后，又偷偷摸摸地回到作业场里，从里面偷听着他们跟经理的对话。</p>\n" +
                "<p></p>\n" +
                "<p>接着那个男人拿出手机按下号码，开始小声地说起话来。</p>\n" +
                "<p></p>\n" +
                "<p>“是的，如果是超级美少年的话一定就是他们没错了。经理在跟他们说东西被偷的事，他们可能已经察觉到不对劲了吧。”</p>\n" +
                "<p></p>\n" +
                "<p>男人又听了一会儿手机然后点了点头……</p>\n" +
                "<p></p>\n" +
                "<p>“是，我这边没问题，我会继续偷偷监视他们。那家伙不知道在搞什么，竟然想爆料给什么都不清楚的店长，所以我才说乡下土包子根本就不能用嘛。”</p>\n" +
                "<p></p>\n" +
                "<p>说完把手机收进口袋之后，男人又赶紧回到了作业场。</p>\n" +
                "<p></p>\n" +
                "<p>夜晚。</p>\n" +
                "<p></p>\n" +
                "<p>山猫楼的厨房也已经过了晚餐忙碌的尖峰时段，须奈子趁着工作的空当时间喝了口茶，稍作休息。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐，你还好吧？”</p>\n" +
                "<p></p>\n" +
                "<p>周虽然关心依然流了满身大汗的须奈子，但其实他自己身上流的汗也不必须奈子少。</p>\n" +
                "<p></p>\n" +
                "<p>“我没事。跟一直待在火旁边的师父比起来，我根本就不算什么。”</p>\n" +
                "<p></p>\n" +
                "<p>“呵呵呵，里面确实很热。你把这个吃了吧，很消暑的。”</p>\n" +
                "<p></p>\n" +
                "<p>说完之后周便弯下巨大的身体，把拿过来的玻璃容器放在须奈子面前。容器里面放了满满类似果冻的黑色物体，上面还洒着水果和豆子。</p>\n" +
                "<p></p>\n" +
                "<p>“师父，这是什么东西？”</p>\n" +
                "<p></p>\n" +
                "<p>“这叫作仙草冻。它原本是植物，熬过之后就会变成这样黑漆漆的样子。外表虽然不好看，但相当甘甜可口。”</p>\n" +
                "<p></p>\n" +
                "<p>在帮忙店里事情的事情也是一样，周总是教给须奈子许多她不知道的料理，而且那些料理每一种都很美味。须奈子现在也是兴致勃勃地把这没看过的黑色果冻放进了嘴里。</p>\n" +
                "<p></p>\n" +
                "<p>“须奈子小姐的皮肤真是白，老家是在北方吗？”</p>\n" +
                "<p></p>\n" +
                "<p>“素北海道。”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子一边吃着又冰凉又甘甜的仙草冻一边回答道。</p>\n" +
                "<p></p>\n" +
                "<p>“啊啊，所以夏天真是很难熬吧？”</p>\n" +
                "<p></p>\n" +
                "<p>“是啊，所以夏天的时候我都做些比较清淡的料理，但这样反而会更加沒有体力。”</p>\n" +
                "<p></p>\n" +
                "<p>“那是当然了。而且如果中暑的话，就更不想用火来做菜了吧？”</p>\n" +
                "<p></p>\n" +
                "<p>“是啊……”</p>\n" +
                "<p></p>\n" +
                "<p>“呼呵呵呵呵呵呵，我很了解你的心情。所以说当厨师的，在做成让人获得元气的料理之前，自己也得先有元气才行啊。知道了吗？”</p>\n" +
                "<p></p>\n" +
                "<p>周在说完之后，再度为了处理客人的点菜而走到锅子前，然后把油倒进中华锅里。虽然汗流雨下，但他还是一样很高兴地配合嘴里那“呼呵、呼呵”的节奏甩着锅子。</p>\n" +
                "<p></p>\n" +
                "<p>“首先自己得有元气才行……”</p>\n" +
                "<p></p>\n" +
                "<p>须奈子一边看着周那庞大的背影，一边轻轻点了一下头。</p>\n" +
                "<p></p>\n" +
                "<p>这时候的中原宅邸里，听着电话留言的三个人，一动也不动地佇立在电话前面。</p>\n" +
                "<p></p>\n" +
                "<p>这应该是那个黑西装的声音才对。电话留言里表示须奈子今晚要住在山猫楼别馆里而留了下来。武长急忙打电话到山猫楼去，但也只是得到与留言同一个人的声音，不断重复是须奈子自己说要留下来这样的答案而已。</p>\n" +
                "<p></p>\n" +
                "<p>“实在是太可怜了，我要去接须奈子回来。”</p>\n" +
                "<p></p>\n" +
                "<p>雪之丞已经待不下去了。事情发展至此，武长也同意雪之丞的做法。</p>\n" +
                "<p></p>\n" +
                "<p>“恭平，走吧。沒跟须奈子本人确认过之前，我没办法接受他们的说法。”</p>\n" +
                "<p></p>\n" +
                "<p>“搞什么嘛，我们才刚到家而已耶。”</p>\n" +
                "<p></p>\n" +
                "<p>恭平虽然很不愿意出门，但也没有办法。要是事情再闹大一点的话，一定会被房东阿姨发现的。</p>\n" +
                "<p>最新最全的日本动漫轻小说 幻梦轻小说</p>\n" +
                "<p>(http://www.huanmengacg.com)</p>\n" +
                "<p>更多轻小说与TXT下载，尽在幻梦轻小说网（www.huanmengacg.com）</p>\n" +
                "<p></p>\n" +
                "<p></p>";
        s = s.replaceAll("<p[^>]*>\\s*</p>",  "");
        System.out.println(s);
    }
}
